---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceRotation
source: html/8b8f2ebd-47ea-74ae-acda-8c1412cc07e1.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceRotation Property

The property labeled "Rotation" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string SurfaceRotation { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.